УТ_для_edt/src/ChartsOfCharacteristicTypes/ДополнительныеРеквизитыИСведения/ДополнительныеРеквизитыИСведения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ДополнительныеРеквизитыИСведения</name>
  <type>
    <types>CatalogRef.Номенклатура</types>
    <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    <types>CatalogRef.Валюты</types>
    <types>CatalogRef.СегментыПартнеров</types>
    <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
    <types>CatalogRef.ДоговорыКонтрагентов</types>
    <types>CatalogRef.ЗначенияСвойствОбъектовИерархия</types>
    <types>CatalogRef.Организации</types>
    <types>CatalogRef.СтруктураПредприятия</types>
    <types>Boolean</types>
    <types>CatalogRef.Пользователи</types>
    <types>CatalogRef.ДоговорыКредитовИДепозитов</types>
    <types>CatalogRef.ЗначенияСвойствОбъектов</types>
    <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    <types>CatalogRef.Контрагенты</types>
    <types>CatalogRef.Файлы</types>
    <types>CatalogRef.Партнеры</types>
    <types>String</types>
    <types>Date</types>
    <types>CatalogRef.ГруппыФинансовогоУчетаНоменклатуры</types>
    <types>CatalogRef.СтраныМира</types>
    <types>Number</types>
    <types>CatalogRef.НаправленияДеятельности</types>
    <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
    <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    <types>CatalogRef.ФизическиеЛица</types>
    <types>CatalogRef.СегментыНоменклатуры</types>
    <types>CatalogRef.БизнесРегионы</types>
    <types>CatalogRef.CRM_Сайты</types>
    <types>CatalogRef.Проекты</types>
    <types>CatalogRef.Склады</types>
    <types>CatalogRef.CRM_Отрасли</types>
    <types>CatalogRef.УдалитьCRM_ТипыОтношений</types>
    <numberQualifiers>
      <precision>17</precision>
      <scale>5</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>1024</length>
    </stringQualifiers>
  </type>
  <attributes>
    <name>Виден</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецДополнительныхЗначений</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьВВидеГиперссылки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеЗначенияИспользуются</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеЗначенияСВесом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Доступен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаголовокФормыВыбораЗначения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаголовокФормыЗначения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнятьОбязательно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МногострочноеПолеВвода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подсказка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматСвойства</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоДополнительноеСведение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДляФормул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗависимостиДополнительныхРеквизитов</name>
    <attributes>
      <name>ЗависимоеСвойство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаборСвойств</name>
      <type>
        <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
        <types>String</types>
        <stringQualifiers>
          <length>99</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Условие</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Представления</name>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заголовок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>75</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подсказка</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаголовокФормыЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаголовокФормыВыбораЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

УТ_для_edt/src/ChartsOfCharacteristicTypes/ДополнительныеРеквизитыИСведения/Forms/CRM_ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	CRM_ОбщегоНазначенияСервер.СбросНастроекПоложенияОкна(ЭтотОбъект);
	
	Если Объект.Ссылка.Пустая() Тогда
		Заголовок = НСтр("ru='Новое поле';en='New Field'");
		Элементы.УстановитьПометкуУдаления.Видимость = Ложь;
	Иначе
		Элементы.ТипЗначения.ТолькоПросмотр = Истина;
		Элементы.НаборСвойств.ТолькоПросмотр = Истина;
		Элементы.ГруппаЧисло.ТолькоПросмотр = Истина;
		Элементы.СтрокаДлина.ТолькоПросмотр = Истина;
		Элементы.СтрокаДлина.ТолькоПросмотр = Истина;
		Элементы.ГруппаДата.ТолькоПросмотр = Истина;
		Заголовок = НСтр("ru='Поле';en='Field'");
		ТипПоля = Строка(Объект.ТипЗначения);
		Если Объект.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ЗначенияСвойствОбъектов") Тогда
			ТипПоля = "ДополнительноеЗначение";
			ЗаполнитьСписокДопЗначений();
		ИначеЕсли Объект.ТипЗначения.СодержитТип(Тип("Строка")) Тогда
			СтрокаДлина = Объект.ТипЗначения.КвалификаторыСтроки.Длина;
		КонецЕсли;
	КонецЕсли;
	
	СписокНаборовДопРеквизитов = Неопределено;
	Если Параметры.Свойство("СписокНаборовДопРеквизитов", СписокНаборовДопРеквизитов) Тогда
		Если СписокНаборовДопРеквизитов.Количество() > 0 Тогда
			Если НЕ ЗначениеЗаполнено(Объект.НаборСвойств) Тогда
				Объект.НаборСвойств = СписокНаборовДопРеквизитов[0].Значение;
			КонецЕсли;	
		КонецЕсли;
		Для каждого Набор Из СписокНаборовДопРеквизитов Цикл
			Элементы.НаборСвойств.СписокВыбора.Добавить(Набор.Значение, Набор.Представление);
		КонецЦикла;
		Если СписокНаборовДопРеквизитов.Количество() > 1 Тогда
			Элементы.НаборСвойств.Видимость = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если СтрокаДлина = 0 Тогда
		СтрокаДлина = 1024;
	КонецЕсли;
	Если ЧислоДлина = 0 Тогда
		ЧислоДлина = 15;
		ЧислоТочность = 3;
	КонецЕсли;
	Если ДатаСостав = "" Тогда
		ДатаСостав = "ДатаВремя";
	КонецЕсли;
	
	CRM_ОсновнойГолубой = ЦветаСтиля.CRM_ОсновнойГолубой;
	CRM_СерыйДляВторостепенныхФункций = ЦветаСтиля.CRM_СерыйДляВторостепенныхФункций;
	ОбновитьСоставЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РасцветкаМногострочного();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	Элементы.УстановитьПометкуУдаления.Заголовок = ?(Объект.ПометкаУдаления, НСтр("ru='Возобновить';en='Resume'"), НСтр("ru='Удалить'"));
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если НЕ Модифицированность Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗавершениеРаботы Тогда
			
		Отказ = Истина;
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект);
		ПоказатьВопрос(ОповещениеОЗакрытии, НСтр("ru = 'Данные были изменены. Сохранить изменения?'"), РежимДиалогаВопрос.ДаНетОтмена);
		
	Иначе
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Готово(Неопределено);
		
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		
		Модифицированность = Ложь;
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Однострочное(Команда)
	Объект.МногострочноеПолеВвода = 0;
	РасцветкаМногострочного();
КонецПроцедуры

&НаКлиенте
Процедура Многострочное(Команда)
	Объект.МногострочноеПолеВвода = 3;
	РасцветкаМногострочного();
КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)
	
	Объект.Наименование = Объект.Заголовок + " (" + Строка(Объект.НаборСвойств) + ")";
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Виден = Истина;
		Объект.Доступен = Истина;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Имя) Тогда
		ЗаголовокОбъекта = Объект.Заголовок;
		ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ЗаголовокОбъекта, "");
		ЗаголовокОбъектаЧастями = СтрРазделить(ЗаголовокОбъекта, " ", Ложь);
		Для Каждого ЧастьЗаголовка Из ЗаголовокОбъектаЧастями Цикл
			Объект.Имя = Объект.Имя + ВРег(Лев(ЧастьЗаголовка, 1)) + Сред(ЧастьЗаголовка, 2);
		КонецЦикла;
		УИД = Новый УникальныйИдентификатор();
		СтрокаУИД = СтрЗаменить(Строка(УИД), "-", "");
		Объект.Имя = Объект.Имя + "_" + СтрокаУИД;
	КонецЕсли;
	
	Если Записать() Тогда
		
		ЗаписатьНаборДопРеквизитов();
		
		Если Объект.ДополнительныеЗначенияИспользуются Тогда
			ЗаписатьЗначенияСвойства();
		КонецЕсли;
		Оповестить("Запись_ДополнительныеРеквизитыИСведения",
			Новый Структура("Ссылка", Объект.Ссылка), Объект.Ссылка);
		
		Закрыть(Новый Структура("Ссылка, Заголовок, НаборСвойств, ПометкаУдаления", Объект.Ссылка, Объект.Заголовок, Объект.НаборСвойств, Объект.ПометкаУдаления));
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ТипЗначенияПриИзменении(Элемент)
	Если ТипПоля = "Строка" Тогда
		Объект.ТипЗначения = Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(СтрокаДлина));
	ИначеЕсли ТипПоля = "Число" Тогда
		Объект.ТипЗначения = Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(ЧислоДлина,ЧислоТочность));
	ИначеЕсли ТипПоля = "Дата" Тогда
		Объект.ТипЗначения = Новый ОписаниеТипов("Дата",Новый КвалификаторыДаты(ЧастиДаты[ДатаСостав]));
	ИначеЕсли ТипПоля = "Булево" Тогда
		Объект.ТипЗначения = Новый ОписаниеТипов("Булево");
	ИначеЕсли ТипПоля = "ДополнительноеЗначение" Тогда
		Объект.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ЗначенияСвойствОбъектов");
	КонецЕсли;
	Объект.ДополнительныеЗначенияИспользуются = (Объект.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ЗначенияСвойствОбъектов"));	
	ОбновитьСоставЭлементовФормы();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РасцветкаМногострочного()
	Если Объект.МногострочноеПолеВвода = 0 Тогда
		ГолубаяКнопка = Элементы.Однострочное;
		СераяКнопка = Элементы.Многострочное;
	Иначе
		ГолубаяКнопка = Элементы.Многострочное;
		СераяКнопка = Элементы.Однострочное;
	КонецЕсли;
	ГолубаяКнопка.Пометка = Истина;
	ГолубаяКнопка.ЦветФона = CRM_ОсновнойГолубой;
	ГолубаяКнопка.ЦветРамки = CRM_ОсновнойГолубой;
	ГолубаяКнопка.Шрифт = Новый Шрифт(,,Истина);
	СераяКнопка.ЦветФона = CRM_СерыйДляВторостепенныхФункций;
	СераяКнопка.Пометка = Ложь;
	СераяКнопка.ЦветРамки = CRM_СерыйДляВторостепенныхФункций;
	ГолубаяКнопка.Шрифт = Новый Шрифт();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСоставЭлементовФормы()
	
	Элементы.ГруппаСтрока.Видимость = Ложь;
	Элементы.ГруппаЧисло.Видимость = Ложь;
	Элементы.ГруппаДата.Видимость = Ложь;
	Элементы.ГруппаДополнительныеЗначения.Видимость = Ложь;
	Если ТипПоля = "Строка" Тогда
		Элементы.ГруппаСтрока.Видимость = Истина;
		Высота = 15;
	ИначеЕсли ТипПоля = "Число" Тогда
		Элементы.ГруппаЧисло.Видимость = Истина;
		Высота = 13;
	ИначеЕсли ТипПоля = "Дата" Тогда
		Элементы.ГруппаДата.Видимость = Истина;
		Высота = 13;
	ИначеЕсли ТипПоля = "ДополнительноеЗначение" Тогда
		Элементы.ГруппаДополнительныеЗначения.Видимость = Истина;
		Высота = 21;
	Иначе
		Высота = 9;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокДопЗначений()
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗначенияСвойствОбъектов.Ссылка КАК Ссылка,
	                      |	ЗначенияСвойствОбъектов.Наименование КАК Наименование
	                      |ИЗ
	                      |	Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	                      |ГДЕ
	                      |	ЗначенияСвойствОбъектов.Владелец = &Владелец
	                      |	И НЕ ЗначенияСвойствОбъектов.ЭтоГруппа");
	Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДополнительныеЗначения.Добавить(Выборка.Ссылка, Выборка.Наименование);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЗначенияСвойства()
	Для каждого ДопЗначение Из ДополнительныеЗначения Цикл
		Если ЗначениеЗаполнено(ДопЗначение.Значение) Тогда
			Если ДопЗначение.Представление <> ДопЗначение.Значение.Наименование Тогда
				ДопЗначениеОбъект = ДопЗначение.Значение.ПолучитьОбъект();
				ДопЗначениеОбъект.Наименование = ДопЗначение.Представление;
				ДопЗначениеОбъект.Записать();
			КонецЕсли;
		ИначеЕсли ЗначениеЗаполнено(ДопЗначение.Представление) Тогда
			ДопЗначениеОбъект = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент();
			ДопЗначениеОбъект.Владелец = Объект.Ссылка;
			ДопЗначениеОбъект.Наименование = ДопЗначение.Представление;
			ДопЗначениеОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаборДопРеквизитов()
	Если ЗначениеЗаполнено(Объект.НаборСвойств) Тогда
		Если Объект.НаборСвойств.ДополнительныеРеквизиты.Найти(Объект.Ссылка, "Свойство") = Неопределено Тогда
			ОбъектНаборСвойств = Объект.НаборСвойств.ПолучитьОбъект();
			НоваяСтрока = ОбъектНаборСвойств.ДополнительныеРеквизиты.Добавить();
			НоваяСтрока.Свойство = Объект.Ссылка;
			ОбъектНаборСвойств.Записать();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
